In [2]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import yfinance as yf
# pip install yfinance --upgrade --no-cache-dir <- 이거 bash terminal 에서 실행
from pandas import DataFrame
# import plotly

# 폴더 생성
# os 라이브러리
#import os
#if not os.path.isdir("abcd"):
#    os.mkdir("abcd") # 폴더 생성

In [4]:
# 문제!
# 연도별로 그룹바이 연산, 시가총액 평균 구하기
data = [
    ["2017", "삼성", 500],
    ["2017", "LG", 300],    
    ["2017", "SK하이닉스", 200],
    ["2018", "삼성", 600],
    ["2018", "LG", 400],
    ["2018", "SK하이닉스", 300],    
]

columns = ["연도", "회사", "시가총액"]
df = DataFrame(data=data, columns=columns)
df

#result = df.groupby("연도")[["시가총액"]].mean()
#print(result)
#print(type(result))
# 이걸 데이터프레임으로 만들어야 합칠 수 있음. 그래서 데이터 프레임으로 만들어야 함.

#result = df.groupby("연도")[["시가총액"]].mean() #.to_frame() ?? 뭐지 d왜 나는 이미 df였지?
#result.columns = ['시가총액평균']
#print(result)
#print(type(result))

#df2 = df.join(result, on = '연도') # 연도로 지정해줘야, df와 result가 다른 형태임에도, 알아서 잘 찾아서 값 넣어줌.
#print(df2)

     연도      회사  시가총액
0  2017      삼성   500
1  2017      LG   300
2  2017  SK하이닉스   200
3  2018      삼성   600
4  2018      LG   400
5  2018  SK하이닉스   300

In [5]:
# 문제
# 시가총액평균 기준값으로
# 새로운 커럼 : 규모
# 대형주, 중소형주
# numpy.where 사용

In [6]:
result = df.groupby("연도")[["시가총액"]].mean()
print(result)

            시가총액
연도
2017  333.333333
2018  433.333333

In [8]:
result = df.groupby("연도")[["시가총액"]].mean()
result.columns = ['시가총액평균']

In [9]:
df2 = df.join(result, on = '연도') # 연도로 지정해줘야, df와 result가 다른 형태임에도, 알아서 잘 찾아서 값 넣어줌.
df2

     연도      회사  시가총액      시가총액평균
0  2017      삼성   500  333.333333
1  2017      LG   300  333.333333
2  2017  SK하이닉스   200  333.333333
3  2018      삼성   600  433.333333
4  2018      LG   400  433.333333
5  2018  SK하이닉스   300  433.333333

In [12]:
test1 = np.where(df2['시가총액평균']<400)
test1

(array([0, 1, 2]),)

In [13]:
test2 = np.where(df2['시가총액평균']<400, '중소형주' , '대형주')
test2

array(['중소형주', '중소형주', '중소형주', '대형주', '대형주', '대형주'], dtype='<U4')

In [15]:
df2['규모'] = np.where(df2['시가총액']<= df2['시가총액평균'] , '중소형주' , '대형주')
df2

     연도      회사  시가총액      시가총액평균    규모
0  2017      삼성   500  333.333333   대형주
1  2017      LG   300  333.333333  중소형주
2  2017  SK하이닉스   200  333.333333  중소형주
3  2018      삼성   600  433.333333   대형주
4  2018      LG   400  433.333333  중소형주
5  2018  SK하이닉스   300  433.333333  중소형주

In [16]:
# 위는, numpy.where 홀용해서 sereies 연산 한 것

In [17]:
df3=df2.drop('시가총액평균', axis=1)
df3

     연도      회사  시가총액    규모
0  2017      삼성   500   대형주
1  2017      LG   300  중소형주
2  2017  SK하이닉스   200  중소형주
3  2018      삼성   600   대형주
4  2018      LG   400  중소형주
5  2018  SK하이닉스   300  중소형주

# Multi Index

In [18]:
from pandas import DataFrame
import pandas as pd

data = [
    ["영업이익", "컨센서스", 1000, 1200],
    ["영업이익", "잠정치", 900, 1400],
    ["당기순이익", "컨센서스", 800, 900],
    ["당기순이익", "잠정치", 700, 800]
]

df = DataFrame(data=data)
df = df.set_index([0, 1])
df

               2     3
0     1
영업이익  컨센서스  1000  1200
      잠정치    900  1400
당기순이익 컨센서스   800   900
      잠정치    700   800

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
# 이 데이터프레임은 인덱스가 두개임!! multi inde

In [21]:
df.loc[('영업이익'),:]

         2     3
1
컨센서스  1000  1200
잠정치    900  1400

In [22]:
df.loc[('영업이익', '컨센서스'),:]

2    1000
3    1200
Name: (영업이익, 컨센서스), dtype: int64

In [24]:
df2 = df.reset_index()
df2
# 멀티 인덱스가 다루기 어려울 떈... 이렇게 해보셈.

       0     1     2     3
0   영업이익  컨센서스  1000  1200
1   영업이익   잠정치   900  1400
2  당기순이익  컨센서스   800   900
3  당기순이익   잠정치   700   800

In [25]:
# group by 연산할 떄 기준값 두개 주면 무조건 multi index 나옴. 익수갷져야할ㄷ스

In [26]:
# 연습

In [27]:
tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [30]:
tips.groupby(['sex','smoker','day'])[['total_bill', 'tip']].mean()

C:\Users\chaer\AppData\Local\Temp\ipykernel_9832\3028506295.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  tips.groupby(['sex','smoker','day'])[['total_bill', 'tip']].mean()

                    total_bill       tip
sex    smoker day
Male   Yes    Thur   19.171000  3.058000
              Fri    20.452500  2.741250
              Sat    21.837778  2.879259
              Sun    26.141333  3.521333
       No     Thur   18.486500  2.941500
              Fri    17.475000  2.500000
              Sat    19.929063  3.256563
              Sun    20.403256  3.115349
Female Yes    Thur   19.218571  2.990000
              Fri    12.654286  2.682857
              Sat    20.266667  2.868667
              Sun    16.540000  3.500000
       No     Thur   16.014400  2.459600
              Fri    19.365000  3.125000
              Sat    19.003846  2.724615
              Sun    20.824286  3.329286

In [31]:
# multi index 접근하기
result = tips.groupby(['sex','smoker','day'])[['total_bill', 'tip']].mean()
result.loc[('Male','Yes','Fri'), :][1]

C:\Users\chaer\AppData\Local\Temp\ipykernel_9832\1606572608.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  result = tips.groupby(['sex','smoker','day'])[['total_bill', 'tip']].mean()
C:\Users\chaer\AppData\Local\Temp\ipykernel_9832\1606572608.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  result.loc[('Male','Yes','Fri'), :][1]

np.float64(2.74125)

In [38]:
# reset index 해서 해오기
result2 = tips.groupby(['sex', 'smoker', 'day'])[['total_bill', 'tip']].mean().reset_index()
result2.loc[result2['day'] == 'Fri', :]

C:\Users\chaer\AppData\Local\Temp\ipykernel_9832\395181603.py:2: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  result2 = tips.groupby(['sex', 'smoker', 'day'])[['total_bill', 'tip']].mean().reset_index()

       sex smoker  day  total_bill       tip
1     Male    Yes  Fri   20.452500  2.741250
5     Male     No  Fri   17.475000  2.500000
9   Female    Yes  Fri   12.654286  2.682857
13  Female     No  Fri   19.365000  3.125000

In [39]:
from pandas import DataFrame

data = [
    [100, 900, 800, 700],
    [1200, 1400, 900, 800]
]

columns = [
    ['영업이익', '영업이익', '당기순이익', '당기순이익'],
    ['컨센서스', '잠정치', '컨센서스', '잠정치']
]

index = ["2020/06", "2020/09"]

df = DataFrame(data=data, index=index, columns=columns)
df

         영업이익       당기순이익
         컨센서스   잠정치  컨센서스  잠정치
2020/06   100   900   800  700
2020/09  1200  1400   900  800

In [40]:
# 영업이익 부분을 level 0
# 컨센서스 행을 level 1 
# 이라고 부른다. 계층구조 명칭임.

In [41]:
# 여기서 해당 값을 갖고 오고 싶다믄..

In [42]:
import pandas as pd

level_0 = ["영업이익", "당기순이익"]
level_1 = ["컨센서스", "잠정치"]

idx = pd.MultiIndex.from_product([level_0, level_1])
# multi index의 경우이렇게 column을 뽑아서 써야함.
# 뽑은 걸 dataframe으로 바꿔서 써야함
df = pd.DataFrame(data = data, index = ['2020/06' , '2020/09'], columns = idx)

# 이렇게 접근하면 뽑아 써야함
df['영업이익']

         컨센서스   잠정치
2020/06   100   900
2020/09  1200  1400

In [45]:
# 아까 위에처럼 하면 복잡하니까, 방금 위에 처럼 계층구조를 활용해서 하면 뽑기 편함.

In [46]:
df['영업이익']['컨센서스']

2020/06     100
2020/09    1200
Name: 컨센서스, dtype: int64